# Дано действительное положительное число a и целое число n. Вычислите an .
# Решение оформите в виде функции (a, n). Стандартной функцией возведения в степень пользоваться нельзя.
from math import sqrt
print("________________________laba_4_dop_1_____________________")
aa = float(input("vvedi a "))
nn = float(input("vvedi n "))
def funk (a = aa, n = nn):
    x = n
    y = 1
    while x % 1 != 0:
        x = x * 10
        y = y * 10
    if x / y > 0:
        if x = 1:
            c = a
        else:
            i = 0
            while i < x:
            c = c * a
            i += 1
        c = sqtr(c)
        otvet = 
    
else:
                otvet = (" do svyazi ...")
    return otvet
                
