# Алгоритм Евклида для вычисления наибольшего общего делителя двух натуральных чисел, формулируется так: нужно заменять большее число на разность большего и меньшего до тех пор, пока одно из них не станет равно нулю; тогда второе и есть НОД. Напишите программу, которая реализует этот алгоритм.

a, b = map(int, input(). split())

if b > a:
  c = a
  a = b
  b = c

while a - b > 0:
  k = b
  b = a - b
  a = k
  
print(a)
